* TM-Analyse. Training der Modelle

Wir trainieren MTA auf die Dateien, die wir in einem Ordner 'Stuff3' gespeichert haben. Wir schreiben einen ersten Code-Block, um den Ordner 'Stuff3' als Variable in den nachfolgenden Blöcken zu definieren (Pfad anpassen):

#+name: rechpfad
#+begin_src shell :var rechpath="/home/cpsoz/Github/mta-tutorial/Stuff3" :results silent
  echo $rechpath
#+end_src

Wir müssen auch bedenken, dass wir für MTA eine Stopwords-Liste brauchen (im Ordner 'Stopwords'). Es sind Stop-Wörter, die in unserem Fall deutsche Wörter sind und sich im folgenden Ordner befinden (Pfad anpassen):

#+name: stops
#+begin_src shell :var stopwords="/home/cpsoz/Github/mta-tutorial/Stopwords" :results silent
  echo $stopwords
#+end_src

Wir [[https://github.com/cp1972/mta-app/blob/main/automate.md][automatisieren]] die Ausführung von MTA mit der folgenden 'mta-train.txt'-Datei, die wir in unserem 'TM-Skripten' Ordner speichern:

#+name: autotrain-01
#+begin_src shell :var user=nuser :var rech=rechpfad :var stopw=stops :results silent
  touch $user/TM-Skripten/mta-train.txt
  echo $rech"/*" >> $user/TM-Skripten/mta-train.txt
  echo "y" >> $user/TM-Skripten/mta-train.txt
  echo $stopw"/de.txt" >> $user/TM-Skripten/mta-train.txt
  echo "5" >> $user/TM-Skripten/mta-train.txt
  echo "n" >> $user/TM-Skripten/mta-train.txt
  echo "de" >> $user/TM-Skripten/mta-train.txt
  echo "a" >> $user/TM-Skripten/mta-train.txt
  echo "1" >> $user/TM-Skripten/mta-train.txt
  echo "y" >> $user/TM-Skripten/mta-train.txt
  echo "15" >> $user/TM-Skripten/mta-train.txt
  echo "7" >> $user/TM-Skripten/mta-train.txt
  echo "n" >> $user/TM-Skripten/mta-train.txt
  echo "0" >> $user/TM-Skripten/mta-train.txt
#+end_src

Diese Datei trainiert MTA mit Modellen, die von 2 bis 15 Topics reichen. Entsprechend führen wir MTA mit dem folgenden Code-Block aus:

#+name: trainmta
#+begin_src shell :var user=nuser :results none
  cat $user/TM-Skripten/mta-train.txt | python3 $user/TM-Skripten/MTA.py
#+end_src

Aus den Ergebnissen von MTA in der Datei 'Summary*.log' übernehmen wir die relevanten Informationen zur optimalen Anzahl der Topics je Kreuzvalidierungsmethode, die MTA verwendet. Wir übernehmen auch die Information zu der besten Anzahl der Topics nach dem Cophenet Korrelationskoeffizient. Wir speichern diese Informationen in einer Datei 'TM-train-scores.txt'.

#+name: trainscores
#+begin_src shell :var mtadir="/home/cpsoz/Github/mta-tutorial/Org" :var user=nuser :results silent
  echo " " >> $user/TM-train-scores.txt
  cat $mtadir/MTA-Results*/Summary*.log | sed -n '/Elbow /,/Correlation values LDA/p' | awk 'NF' | awk '{$1=$1;print}' >> $user/TM-train-scores.txt
  echo "------" >> $user/TM-train-scores.txt
  echo " " >> $user/TM-train-scores.txt
  find $mtadir -type d -name "MTA-Results*" -exec rm -r {} +
#+end_src

Wir drucken in dieser Datei alle Ergebnisse aus der Datei 'TM-train-scores.txt' mit dem folgenden Code-Block.

#+name: mta-scores
#+begin_src shell :var user=nuser :results drawer
    cat $user/TM-train-scores.txt
#+end_src

#+RESULTS: mta-scores
:results:

Elbow | No optimal topic
Silhouette | Optimal topics, better to worst: 5 6 8 10 11 12 13
Calinski Harabasz | No optimal topic
Davies Bouldin | Optimal topics, better to worst: 3 5 7 8 9 10 11 12 13 14
NMF-Cophenet | Optimal topics, better to worst: 4 5 7 8 9
Correlation values NMF-Cophenet: (0.716109566486473, 0.6179506131579492, 0.6902732151002392, 0.6583955693271775, 0.7208821961680739)
LDA-Cophenet | Optimal topics, better to worst: 3 5 6 7 8 9 10 12 14
Correlation values LDA-Cophenet: (0.9274421873051646, 0.937363992468951, 0.9191851504436633, 0.9591411056925253, 0.9563689757438678, 0.9640684092895591, 0.9143581342924882, 0.9520142005555593, 0.9286992531527984)
------

:end:

Wir können jetzt die Dateien mit der optimalen Topics-Anzahl modellieren.

